loadTest/member_update/logs/stress.txt


  execution: local
     script: stress.js
     output: -

  scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m32s max duration (incl. graceful stop):
           * default: Up to 1000 looping VUs for 1m2s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (1m03.0s), 0000/1000 VUs, 15788 complete and 0 interrupted iterations
default ✓ [======================================] 0000/1000 VUs  1m2s

     ✓ logged in successfully
     ✓ retrieved member

     checks.........................: 100.00% ✓ 31576      ✗ 0
     data_received..................: 8.4 MB  133 kB/s
     data_sent......................: 8.1 MB  129 kB/s
     http_req_blocked...............: avg=194.57µs min=3.26µs med=5.59µs   max=199.2ms  p(90)=11.29µs  p(95)=183.47µs
     http_req_connecting............: avg=155.82µs min=0s     med=0s       max=198.94ms p(90)=0s       p(95)=0s
   ✗ http_req_duration..............: avg=732.06ms min=4.24ms med=696.69ms max=2.95s    p(90)=1.39s    p(95)=1.5s
       { expected_response:true }...: avg=785.21ms min=4.24ms med=789.56ms max=2.68s    p(90)=1.42s    p(95)=1.5s
     http_req_failed................: 50.00%  ✓ 15788      ✗ 15788
     http_req_receiving.............: avg=581.71µs min=23.7µs med=55.34µs  max=127.05ms p(90)=977.21µs p(95)=2.23ms
     http_req_sending...............: avg=368.22µs min=11µs   med=19.79µs  max=197.93ms p(90)=188.95µs p(95)=726.63µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s       max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=731.11ms min=4.12ms med=695.62ms max=2.95s    p(90)=1.39s    p(95)=1.5s
     http_reqs......................: 31576   501.10411/s
     iteration_duration.............: avg=2.46s    min=1s     med=2.44s    max=5.39s    p(90)=3.65s    p(95)=3.92s
     iterations.....................: 15788   250.552055/s
     vus............................: 1       min=1        max=1000
     vus_max........................: 1000    min=1000     max=1000

ERRO[0065] some thresholds have failed